{
  "backend/main.mo": "Actor includes blob-storage mixin to provide storage functionality.",
  "feature_evidence.json": "Feature evidence report describing spacing reduction change on AboutPage and related metadata.",
  "frontend-file-summaries.txt": "Text file listing summaries of all major frontend files and recent updates.",
  "frontend/index.css": "Global Tailwind base styles defining CSS variables for light/dark themes and typography.",
  "frontend/index.html": "HTML entry with metadata and favicon links loading the React app root and main.tsx.",
  "frontend/README_DRAFT_ONLY.md": "Draft review notes for version 26 with profile image update and WhatsApp CTA consistency checklist.",
  "frontend/src/App.tsx": "Sets up TanStack Router, theme provider, and query client, with AboutPage as default route.",
  "frontend/src/components/FaviconLoader.tsx": "Empty component placeholder for dynamic favicon loading.",
  "frontend/src/components/Layout.tsx": "Main layout with header, navigation, mobile menu, scroll-to-top behavior, footer, and floating WhatsApp button.",
  "frontend/src/components/WhatsAppCTAButton.tsx": "Reusable CTA button linking to WhatsApp using shared styling and deep link utility.",
  "frontend/src/components/WhatsAppFloatingButton.tsx": "Fixed-position floating WhatsApp button opening chat link in a new tab.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and updates a backend actor based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication using Dfinity AuthClient, including login state handling and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook that exposes backend readiness state via useActor, reserved for future backend integration.",
  "frontend/src/index.css": "Tailwind-based global stylesheet defining color themes, typography, scrollbars, and utility animations for light and dark modes.",
  "frontend/src/lib/whatsapp.ts": "Generates a WhatsApp deep link with a preset phone number and encoded message.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Displays a detailed professional overview with profile information, biography, and WhatsApp contact link.",
  "frontend/src/pages/CaseStudiesPage.tsx": "Renders multiple case studies with context, challenges, approaches, tools, and outcomes for BI projects.",
  "frontend/src/pages/CertificationsPage.tsx": "Empty page file reserved for future certifications content.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, FormSubmit.co email handling, and WhatsApp contact option.",
  "frontend/src/pages/ExperiencePage.tsx": "Empty placeholder file for future experience page implementation.",
  "frontend/src/pages/HomePage.tsx": "Home page component rotating taglines, showing BI service highlights, a hero section, credibility stats, and CTA buttons.",
  "frontend/src/pages/ImpactPage.tsx": "Impact page listing BI achievements with sections of descriptions and measurable outcomes plus organizational benefits.",
  "frontend/src/pages/ServicesPage.tsx": "Services page defining BI service offerings with problems, deliverables, and outcomes along with a CTA section.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing state, features, new requests, and configuration for ongoing spacing adjustment work on the About page."
}