{
  "kind": "build_request",
  "title": "Reduce vertical spacing under role title and location in About section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "In the About page left column (profile image + title block), reduce the vertical spacing below the role title and location (“Senior Business Intelligence and Analytics Leader” and “Islamabad, Pakistan”) so the left column does not appear visually empty. Adjust spacing only (no text changes, no font changes, no layout restructuring), and ensure the updated spacing is applied consistently on both desktop and mobile layouts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Reduce the vertical spacing below the role title and location (“Senior Business Intelligence and Analytics Leader” and “Islamabad, Pakistan”) in the About section so the left column does not appear visually empty.",
          "Adjust spacing only (no text changes, no font changes, no layout restructuring). Maintain alignment and responsiveness.",
          "Ensure the spacing adjustment is applied consistently across both desktop and mobile layouts.",
          "yes please proceede"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/pages/AboutPage.tsx, the spacing for the title/location block under the profile image is reduced (e.g., by lowering the margin-top and/or vertical gaps) without altering any text content.",
        "No font sizes, font weights, alignment, or grid/column structure are changed; only spacing-related Tailwind classes are modified.",
        "On both mobile and desktop breakpoints, the role title and location sit closer together and/or closer to the profile image compared to current behavior, reducing the perceived empty space in the left column.",
        "No regression to responsiveness: the layout remains centered and aligned as before across breakpoints."
      ]
    }
  ],
  "constraints": [
    "Adjust spacing only; do not change any text, copy, or content.",
    "Do not change fonts (family/weight/size) or typography styling.",
    "Do not restructure the layout (no grid changes, no moving elements between columns).",
    "Maintain existing alignment and responsiveness across desktop and mobile."
  ],
  "nonGoals": [
    "Changing the profile image, About page content, or adding new elements to fill space.",
    "Any changes to other sections (Professional Overview, Selected Impact Snapshot, Education, Certifications).",
    "Backend changes or data/model changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}